levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32f160_ll_interrupts_share.c
/**
 * @brief  Interrupt No.031 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ031_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    /* LVD detected */
    if (0UL == bCM_EFM->LVDICGCR_b.LVDDIS) {
        u32Tmp1 = bCM_PWC->LVDCSR_b.DETF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL2) && (0UL != u32Tmp1)) {
            PWC_LVD_IrqHandler();
        }
    }
    /* USART6 Tx end */
    if (1UL == bCM_USART6->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART6->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL3) && (0UL != u32Tmp1)) {
            USART6_TxComplete_IrqHandler();
        }
    }
    /* EFM operate end */
    if (1UL == bCM_EFM->FITE_b.OPTENDITE) {
        u32Tmp1 = bCM_EFM->FSR_b.OPTEND;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL4) && (0UL != u32Tmp1)) {
            EFM_OpEnd_IrqHandler();
        }
    }
    /* RTC alarm */
    if (1UL == bCM_RTC->CR2_b.ALMIE) {
        u32Tmp1 = bCM_RTC->CR2_b.ALMF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL5) && (0UL != u32Tmp1)) {
            RTC_Alarm_IrqHandler();
        }
    }
    /* RTC period */
    if (1UL == bCM_RTC->CR2_b.PRDIE) {
        u32Tmp1 = bCM_RTC->CR2_b.PRDF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL6) && (0UL != u32Tmp1)) {
            RTC_Period_IrqHandler();
        }
    }
    /* TimerB2 overflow */
    if (1UL == bCM_TMRB_2->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_2->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_2_Ovf_IrqHandler();
        }
    }
    /* TimerB2 underflow */
    if (1UL == bCM_TMRB_2->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_2->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_2_Udf_IrqHandler();
        }
    }
    /* TimerB1 compare match */
    if (1UL == bCM_TMRB_1->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_1->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_1_Cmp_IrqHandler();
        }
    }
    if (1UL == bCM_ADC->AWDCR_b.AWD1IEN) {
        /* ADC convert result in range of window 1 if independence use */
        u32Tmp1 = bCM_ADC->AWDSR_b.AWD1F;
        u32Tmp2 = (uint32_t)CM_ADC->AWDCR & (uint32_t)ADC_AWDCR_AWDCM;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL11) && (0UL != u32Tmp1) && (0UL == u32Tmp2)) {
            ADC_Cmp1_IrqHandler();
        }
        /* ADC convert result combination use of window 0 & 1 */
        u32Tmp1 = bCM_ADC->AWDSR_b.AWDCMF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL11) && (0UL != u32Tmp1) && (0UL != u32Tmp2)) {
            ADC_Cmp1_IrqHandler();
        }
    }
    /* USART2 Tx end */
    if (1UL == bCM_USART2->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART2->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_TxComplete_IrqHandler();
        }
    }
    /* SPI Tx buffer empty */
    if (1UL == bCM_SPI->CR1_b.TXIE) {
        u32Tmp1 = bCM_SPI->SR_b.TDEF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL13) && (0UL != u32Tmp1)) {
            SPI_TxEmpty_IrqHandler();
        }
    }
    /* USART4 Tx end */
    if (1UL == bCM_USART4->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART4->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL15) && (0UL != u32Tmp1)) {
            USART4_TxComplete_IrqHandler();
        }
    }
}
/**
 * @}
 */

/**
 * @defgroup Share_Interrupts_Weakdef_Prototypes Share Interrupts weak function prototypes
 * @{
 */
__WEAKDEF void EXTINT08_IrqHandler(void)
{
}

__WEAKDEF void EXTINT09_IrqHandler(void)
{
}

__WEAKDEF void EXTINT10_IrqHandler(void)
{
}

__WEAKDEF void EXTINT11_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC0_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC0_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC1_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC1_IrqHandler(void)
{
}

__WEAKDEF void DMA_Error_IrqHandler(void)
{
}

__WEAKDEF void EFM_ProgramEraseError_IrqHandler(void)
{
}

__WEAKDEF void EFM_ColError_IrqHandler(void)
{
}

__WEAKDEF void EFM_OpEnd_IrqHandler(void)
{
}

__WEAKDEF void CLK_XtalStop_IrqHandler(void)
{
}

__WEAKDEF void SWDT_IrqHandler(void)
{
}

__WEAKDEF void TMRB_1_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_1_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_1_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_2_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_2_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_2_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_3_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_3_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_3_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_4_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_4_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_4_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_5_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_5_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_5_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_6_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_6_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_6_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_7_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_7_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_7_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_8_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_8_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_8_Cmp_IrqHandler(void)
{
}

__WEAKDEF void USART1_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART1_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART1_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART1_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART2_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART2_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART2_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART2_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART3_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART3_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART3_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART3_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART4_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART4_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART4_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART4_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART5_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART5_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART5_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART5_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART6_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART6_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART6_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART6_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void I2C_RxFull_IrqHandler(void)
{
}

__WEAKDEF void I2C_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void I2C_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void I2C_EE_IrqHandler(void)
{
}

__WEAKDEF void SPI_RxFull_IrqHandler(void)
{
}

__WEAKDEF void SPI_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void SPI_Idle_IrqHandler(void)
{
}

__WEAKDEF void SPI_Error_IrqHandler(void)
{
}

__WEAKDEF void CTC_IrqHandler(void)
{
}

__WEAKDEF void EKEY_IrqHandler(void)
{
}

__WEAKDEF void TMR0_CmpA_IrqHandler(void)
{
}

__WEAKDEF void ADC_SeqA_IrqHandler(void)
{
}

__WEAKDEF void ADC_SeqB_IrqHandler(void)
{
}

__WEAKDEF void ADC_Cmp0_IrqHandler(void)
{
}

__WEAKDEF void ADC_Cmp1_IrqHandler(void)
{
}

__WEAKDEF void PWC_LVD_IrqHandler(void)
{
}

__WEAKDEF void RTC_Alarm_IrqHandler(void)
{
}

__WEAKDEF void RTC_Period_IrqHandler(void)
{
}

/**
 * @}
 */

#endif /* LL_INTERRUPTS_SHARE_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
